Revit 2026 API

# AdvancedWoodWoodPoreDepth Property

---

The property labeled "Bump depth variation (cm) for pores" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodPoreDepth { get; }
```
```vb
Public Shared ReadOnly Property WoodPoreDepth As String
	Get
```
```cpp
public:
static property String^ WoodPoreDepth {
	String^ get ();
}
```
```fsharp
static member WoodPoreDepth : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDistance".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace